package com.klimjavadev.HelpDeskOfHousingOffice.models.enums;

public enum Task {
    ONE,
    TWO

//    Прибирання прибудинкової території
//
//    Прибирання і вивезення снігу
//
//    Посипання частини прибудинкової території, призначеної для проходу та проїзду, протиожеледними сумішами
//
//    Прибирання сходових кліток
//
//    Прибирання підвалу
//
//    Прибирання технічних поверхів
//
//    Прибирання покрівлі
//
//    Вивезення побутових відходів
//
//    Технічне обслуговування ліфту
//
//    Технічне обслуговування внутрішньобудинкової системи теплопостачання
//
//    Технічне обслуговування внутрішньобудинкової системи водопостачання
//
//    Технічне обслуговування внутрішньобудинкової системи водовідведення
//
//    Дератизація (знищення гризунів)
//
//    Дезінсекція (знищення всіх видів комах, боротьба з тарганами, клопами, блохами…)
//
//    Обслуговування димовентиляційного каналу
//
//    Технічне обслуговування та поточний ремонт системи протипожежної автоматики
//
//    Технічне обслуговування та поточний ремонт системи димовидалення
//
//    Технічне обслуговування та поточний ремонт  внутрішньобудинкової інженерної системи
//
//    Поточний ремонт конструктивних елементів внутрішньобудинкової системи гарячого водопостачання
//
//    Поточний ремонт конструктивних елементів внутрішньобудинкової системи холодного водопостачання
//
//    Поточний ремонт конструктивних елементів внутрішньобудинкової системи теплопостачання
//
//    Поточний ремонт конструктивних елементів внутрішньобудинкової системи зливової каналізації
//
//    Поточний ремонт конструктивних елементів технічних пристроїв будинку
//
//    Поточний ремонт конструктивних елементів зовнішнього упорядження
//
//    Освітлення місць загального користування
//
//    Освітлення підвалу загального користування
//
//    Підкачування води
//
//    Енергопостачання ліфту
//
//    Поливання двору, клумб і газонів
//
//    Експлуатація номерних знаків на будинку
//
//    Повірка  та обслуговування квартирних засобів обліку води, у тому числі, їх демонтаж, транспортування та монтаж після повірки
//
//    Повірка  та обслуговування квартирних засобів обліку теплової енергії, у тому числі, їх демонтаж, транспортування та монтаж після повірки
//
//    Ремонт квартирних засобів обліку води
//
//    Ремонт квартирних засобів обліку теплової енергії
//
//    Вологе підмітання
//
//    Промивання вікон на сходовому майданчику
//
//    Обмітання пилу та павутини зі стін і стель місць загального користування
//
//    Протирання підвіконня в під'їзду, віконні грати, поручні та поштові скриньки
//
//    Протирання віконних грат в під'їзду
//
//    Протирання поручнів під'їзду
//
//    Протирання поштових скриньок
//
//    Розміщення на видному та прохідному місці у дворі будинку списку адрес і телефонних номерів диспетчерської служби ЖЕКу, райадміністрації, організацій по наданню послуг тепло-, газо-, електро-, водопостачання і водовідведення, пожежної охорони, відділення міліції, швидкої допомоги, санепідемстанції, аварійних служб житлового господарства
//
//    Заміна технічних засобів житлового будинку(у неприватизованих квартирах)
//
//    Заміна труб загального стояка на сходовому майданчику
//
//    Заміна електрощитка на сходовому майданчику
//
//    Заміна лампочок в під'їзді
}
